Documents/ОперацияМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОперацияМеждународный</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическиеДанныеБюджетирования</xr:Item>
				<xr:Item>AccountingRegister.МеждународныйБезКорреспонденции</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьПериодПоСтрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннееПотребление</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаписьКнигиПокупок</v8:Type>
								<v8:Type>cfg:DocumentRef.АмортизацияОСМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаДавальцу</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеМатериаловВПроизводстве</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ПереоценкаНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
								<v8:Type>cfg:DocumentRef.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученныйАванс</v8:Type>
								<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеУслугПоАренде</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнойДокументПодтвержденияНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетДавальцу</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
								<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
								<v8:Type>cfg:DocumentRef.АмортизацияНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнесениеДенежныхСредствВКассуККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.РасчетКурсовыхРазниц</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеСырьяОтДавальца</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеПараметровОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеПроизводственныхЗатрат</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
								<v8:Type>cfg:DocumentRef.РегламентнаяОперацияМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.АмортизацияНМАМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратОСИзАренды2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ОбесценениеВНА</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхВнутреннихРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОСМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ОбъединениеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеПараметровНМАМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияМеждународный</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковОСМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковНМАМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаНалогообложенияНДСПартийТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНМАМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеНМАМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеРасходовБудущихПериодов</v8:Type>
								<v8:Type>cfg:DocumentRef.РазукомплектацияОС</v8:Type>
								<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПогашениеСтоимостиТМЦВЭксплуатации</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.МодернизацияОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНДСНаРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНедостачТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратСырьяДавальцу</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ДвижениеПродукцииИМатериалов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.ПереоценкаОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.Сторно</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
								<v8:Type>cfg:DocumentRef.АмортизацияОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПересортицаТоваровУХранителя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковНДСПредъявленного</v8:Type>
								<v8:Type>cfg:DocumentRef.РасчетРезервовПодОбесценениеЗапасов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеАрендованныхОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВФинансовомУчете</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПереоценкаНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаСырьяПереработчику</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковВнеоборотныхАктивов</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаНазначенияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыбытиеДенежныхДокументов</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковРасходовПриУСН</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПереоценкаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеОСМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.АмортизацияНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
								<v8:Type>cfg:DocumentRef.АннулированиеПодарочныхСертификатов</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетДавальцу2_5</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковПоФинансовымИнструментам</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеПараметровОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаСтоимостиИАмортизацииОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхВозвратах</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратСырьяОтПереработчика</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровСХранения</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеОСМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровУХранителя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
								<v8:Type>cfg:DocumentRef.АмортизацияОС2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзПроизводства</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыкупАрендованныхОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковПрочиеРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМАМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураКомиссионеру</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеПараметровНМА2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратОСИзАренды</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыУПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.РегламентнаяОперация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.РасчетСебестоимостиТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
								<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
								<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияПодарочныхСертификатов</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеПараметровОСМеждународныйУчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаписьКнигиПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетПереработчика2_5</v8:Type>
								<v8:Type>cfg:DocumentRef.ПризнаниеРасходовПоИсследованиямИРазработкам</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратПодарочныхСертификатов</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОСВАренду2_4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаМатериаловВПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковРасчетовПоЭквайрингу</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковСПодотчетниками</v8:Type>
								<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеОтПереработчика</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыбытиеАрендованныхОС</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураНалоговыйАгент</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковПрочихАктивовПассивов</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетДавальцуМеждуОрганизациями</v8:Type>
								<v8:Type>cfg:DocumentRef.ПорчаТоваровУХранителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОперацияМеждународный/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Команда = Документы.ОперацияМеждународный.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.Представление = НСтр("ru = 'Сторно: Операция (международный учет):';
									|en = 'Storno: Transaction (financial accounting):'");
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду создания документа "Операция (международный учет)".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - Добавить команду создать на основании:
// * Представление - Строка -
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОперацияМеждународный) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ОперацияМеждународный.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ОперацияМеждународный);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьМеждународныйФинансовыйУчет";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Возврат; //В дальнейшем будет добавлен код команд
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Бухгалтерская справка
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БухгалтерскаяСправка";
	КомандаПечати.Представление = НСтр("ru = 'Бухгалтерская справка (международный учет)';
										|en = 'Accounting statement (financial accounting)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьБухгалтерскойСправкиМеждународныйУчет";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПолеСодержаниеОперации", "СодержаниеОперации");
	КомандаПечати.ДополнительныеПараметры.Вставить("ТипДокумента", "ОперацияМеждународный");
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
